"""
剑指 Offer 10- II. 青蛙跳台阶问题
一只青蛙一次可以跳上1级台阶，也可以跳上2级台阶。求该青蛙跳上一个 n 级的台阶总共有多少种跳法。

答案需要取模 1e9+7（1000000007），如计算初始结果为：1000000008，请返回 1。

示例 1：

输入：n = 2
输出：2
示例 2：

输入：n = 7
输出：21
示例 3：

输入：n = 0
输出：1
"""
""" 题解
①状态表达。f(i)为前f(i-1)和f(i-2)之和。
②状态转移。f(n) = f(n-1)+f(n-2)。
0 1 2 3 4 5
1 1 2 3 5 8

i=3
1 1 1
1 2
2 1

i=4
1 1 1 1
1 1 2
1 2 1
2 1 1
2 2

i=5
1 1 1 1 1
1 1 1 2
1 1 2 1
1 2 1 1
2 1 1 1
1 2 2
2 1 2
2 2 1

输入：n = 2
输出：2
示例 2：

输入：n = 7
输出：21
示例 3：

输入：n = 0
输出：1
"""


class Solution:
    def numWays(self, n: int):
        if n == 0:
            return 1
        if n == 1:
            return 1
        a, b = 1, 1
        for i in range(2, n+1):
            t = a+b
            a = b
            b = t
        return t % 1000000007


solution = Solution()
print(solution.numWays(7))
